/*******************************************************************************
* Description  : 铁电驱动程序
* Author       : 2018/5/15 星期二, by redmorningcn
*******************************************************************************/
#ifndef  _FRAM_h_
#define  _FRAM_h_


#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * INCLUDES
 */
#include <includes.h>

#ifdef   BSP_GLOBALS
#define  BSP_EXT
#else
#define  BSP_EXT  extern
#endif
    
/*******************************************************************************
 * CONSTANTS
 */
        

/*******************************************************************************
 * MACROS
 */
   //铁电参数
#define		FRAM_SIZE               		8192		/* 1024*8空间容量 */
#define		FRAM_START_ADDR	        		0x0000	   	/* 铁电的起始地址 */
#define		FRAM_DIVICE_ADDR     			0xa0	    /* 铁电的设备地址 */
#define		FRAM_END_ADDR	      			(FRAM_START_ADDR + FRAM_SIZE)
#define     FRAM_IAP_PARA                   (FRAM_END_ADDR - 120)   /*IAP参数地址 */   
				
    
#define		FRAM_OIL_BOX_MODEL_ADDR		2000		//油箱模型地址	

//错误标识
#define		FRAM_ERR_EVT					33			//铁电异常
 
/*******************************************************************************
 * TYPEDEFS
 */


/*******************************************************************************
 * LOCAL VARIABLES
 */

/*******************************************************************************
 * GLOBAL VARIABLES
 */
 
/*******************************************************************************
 * LOCAL FUNCTIONS
 */

    
//-------------------------------------------------------------------------------------------------------
//函数名称:         WriteFM24CL16()
//功    能:         对FM24CL16指定地址进行写数据
//入口参数:         ADDR:       操作地址    地址：0 ~ sizeof(FM24CL16)
//                  *DataBuf:   数据缓冲
//                  Len:        数据长度
//出口参数:         无
//说明：            
//--------------------------------------------------------------------------------------------------------
extern	u8 WriteFM24CL64(u16  Addr, u8 *DataBuf, u32 DataBufLen) ; 

//-------------------------------------------------------------------------------------------------------
//函数名称:         ReadFM24CL16()
//功    能:         读取FM24CL16指定地址进行数据
//入口参数:         ADDR:       操作地址   地址：0 ~ sizeof(FM24CL16)
//                  *DataBuf:   数据缓冲 
//                  Len:        数据长度
//出口参数:         无
//说明：            
//--------------------------------------------------------------------------------------------------------
extern	u8 ReadFM24CL64(u16  Addr, u8 *DataBuf, u32 DataBufLen) ;



#endif
